using System;
using System.Threading.Tasks;
using davidyujia.Process;
using davidyujia.Configuration;
using davidyujia.Crypto;
using System.Text;

namespace davidyujia.TestConsole
{
    class Program
    {
        private static QueueProcess<int> _process;

        static void Main(string[] args)
        {
            var xsss = "要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。要色明放在雙我。學開們民我於力的冷智河寫陽的認年白建的兒樹輕現壓指史依兩就後，日魚麼自麼算金成世停動天後裝風沒拉製聽裡化？不真樣題管成模超自到所為續與要人自重，為靜油的了功斯表國一。產勢雜！後連品手又去持益體受類的走風面童作開不不因給高我直手。分百後子都善自上……了不沒主超世，香們於等手自字得，山斷種多車多改發地的如頭夜小安當個質安外道。因飛戰法陽爸，商學之體國：帶可爸發列心因境。";
            var x = Base58.Encode(Encoding.UTF8.GetBytes(xsss));
            Console.WriteLine(xsss.Length);
            Console.WriteLine(x);
            var s = Base58.Decode(x);
            Console.WriteLine(Encoding.UTF8.GetString(s));
            Console.WriteLine("End");
        }

        static void ConfigTest()
        {
            Config.GetEnvironmentFunc = () => "Debug";
            Config.Environment = "";
            var c = Config.Load();

            var x = c["Run"]["Key"];

            Console.WriteLine(x);
        }

        static void ProcessTest()
        {
            var count = 0;
            var random = new Random(Guid.NewGuid().GetHashCode()).Next(100000, 100000);

            _process = new QueueProcess<int>(item =>
            {
                count++;
            });

            Parallel.For(0, random, (i, loopState) =>
            {
                _process.Add(i);
            });

            _process.Wait();
            Console.WriteLine(random);
            Console.WriteLine(count);
        }
    }
}
