using System;
using System.Threading.Tasks;
using davidyujia.Process;
using davidyujia.Configuration;
using davidyujia.Crypto;
using System.Text;
using System.Diagnostics;

namespace davidyujia.TestConsole
{
    class Program
    {
        private static QueueProcess<int> _process;

        static void Main(string[] args)
        {
            Stopwatch sw = new Stopwatch();
            var xsss = Encoding.UTF8.GetBytes("那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。那要完驚上是還媽不學處當的濟臺作有增果機，建半我爸的可往似有們高地用的上成記將子他他法更它都權這親的：以的待一施過功結就研，中望的出解那臺高變各太西走以似：分國中精收往出此讓在這長，當方可們兩……看上壓認有面港爾知會、己大最像運能家作給華見，望先利也量；信大球，政為。");

            while (true)
            {
                sw.Reset();
                sw.Start();
                var x = Base58.Encode(xsss);
                sw.Stop();
                Console.WriteLine(xsss.Length);
                Console.WriteLine("E: " + sw.Elapsed.TotalSeconds);
                sw.Reset();
                sw.Start();
                var s = Base58.Decode(x);
                sw.Stop();
                Console.WriteLine("D: " + sw.Elapsed.TotalSeconds);
                Console.WriteLine(Encoding.UTF8.GetString(s));
                break;
            }
            Console.WriteLine("End");
        }


        static void ConfigTest()
        {
            Config.GetEnvironmentFunc = () => "Debug";
            Config.Environment = "";
            var c = Config.Load();

            var x = c["Run"]["Key"];

            Console.WriteLine(x);
        }

        static void ProcessTest()
        {
            var count = 0;
            var random = new Random(Guid.NewGuid().GetHashCode()).Next(100000, 100000);

            _process = new QueueProcess<int>(item =>
            {
                count++;
            });

            Parallel.For(0, random, (i, loopState) =>
            {
                _process.Add(i);
            });

            _process.Wait();
            Console.WriteLine(random);
            Console.WriteLine(count);
        }
    }
}
